document.write(`<h1>"HomeWork_JS #2"</h1>`);
/*
1. Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті
   години попадає число (в першу, другу, третю или четверту частину години).
2. У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє
    це число (у першу, другу чи третю).
3. У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
    Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким
    записом(тернаркою)
4. Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a,
   що дорівнює 1, 0, -3
5. Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані
   відображається інфа що заплановано на цей день.

6. Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

7. Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
*/

/*
1. Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті
години попадає число (в першу, другу, третю или четверту частину години).
*/
/*
let time = prompt('Введите число от 0 до 59',1);

if(time>0 && time<60) {
    if (time>=0 && time<15) {
        document.write(`<h2>${time} - это первая четверть часа</h2>`)
    } else if (time>=15 && time<30) {
        document.write(`<h2>${time} - это вторая четверть часа</h2>`)
    } else if (time>=30 && time<45) {
        document.write(`<h2>${time} - это третья четверть часа</h2>`)
    } else if (time>=45 && time<60) {
        document.write(`<h2>${time} - это четвертая четверть часа</h2>`)
    }
  } else {
    document.write(`<h2>Введено неверное число, введите число в диапазоне от 0 до 59</h2>`)
}

/*
2. У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє
це число (у першу, другу чи третю).
*/
/*
let day = prompt('Введите число от 1 до 31',1);

if(day>=1 && day<=31) {
    if (day>=1 && day<=10) {
        document.write(`<h2>${day} - это первая декада</h2>`)
    } else if (day>10 && day<=20) {
        document.write(`<h2>${day} - это вторая декада</h2>`)
    } else if (day>20 && day<=31) {
        document.write(`<h2>${day} - это третья декада</h2>`)
    }
} else {
    document.write(`<h2>Введено неверное число, введите число в диапазоне от 1 до 31</h2>`)
}
/**/
/*
3. У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
    Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким
записом(тернаркою)
*/
/*
let a22 = +prompt('Введите 0 или любое другое число',1);
if (a22==0) {
    test=false;
    document.write(`<h1>0</h1>`);
} else {
    document.write(`<h1>1</h1>`);
    test=true;
}

let indicat = test === true  ? true : false;

document.write(`<h1>${indicat}</h1>`);
/**/
/*
4. Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a,
    що дорівнює 1, 0, -3
*/
/*
let a = +prompt('Введите 0 или любое другое число',1);
if (a===0) {
    document.write(`<h1>Невірно</h1>`);
} else {
    document.write(`<h1>Вірно</h1>`);
}
/**/

/*
5. Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані
    відображається інфа що заплановано на цей день.
 */

/*
let b = +prompt('Введите номер дня недели - число от 1 до 7',1);
    switch (b) {
    case 1:
        document.write(`<h1>Понедельник</h1>`);
        document.write(`<h1>1. Работа в офисе</h1>`);
        document.write(`<h1>2. Тренировка в спортзале</h1>`);
        document.write(`<h1>3. Учеба в ОКТЕН, лекция</h1>`);
        break;
    case 2:
        document.write(`<h1>Вторник</h1>`);
        document.write(`<h1>1. Работа в офисе</h1>`);
        document.write(`<h1>2. Тренировка в спортзале</h1>`);
        document.write(`<h1>3. Учеба в ОКТЕН, практика</h1>`);
        break;
    case 3:
        document.write(`<h1>Среда</h1>`);
        document.write(`<h1>1. Работа в офисе</h1>`);
        document.write(`<h1>2. Тренировка в спортзале</h1>`);
        document.write(`<h1>3. Учеба в ОКТЕН, лекция</h1>`);
        break;
    case 4:
        document.write(`<h1>Четверг</h1>`);
        document.write(`<h1>1. Работа в офисе</h1>`);
        document.write(`<h1>2. Тренировка в спортзале</h1>`);
        document.write(`<h1>3. Учеба в ОКТЕН, практика</h1>`);
        break;
    case 5:
        document.write(`<h1>Пятница</h1>`);
        document.write(`<h1>1. Работа в офисе</h1>`);
        document.write(`<h1>2. Тренировка в спортзале</h1>`);
        document.write(`<h1>3. Учеба в ОКТЕН, лекция</h1>`);
        break;
    case 6:
        document.write(`<h1>Суббота</h1>`);
        document.write(`<h1>1. Тренировка в спортзале</h1>`);
        document.write(`<h1>2. Посещение театра</h1>`);
        document.write(`<h1>3. Прогулка по городу</h1>`);
        break;
    case 7:
        document.write(`<h1>Воскресенье</h1>`);
        document.write(`<h1>1. Тренировка в спортзале</h1>`);
        document.write(`<h1>2. Посещение театра</h1>`);
        document.write(`<h1>3. Прогулка по городу</h1>`);
        break;
    default:
        document.write(`<h1>Введено неправильное число. Введите число от 1 до 7</h1>`);
    }
    /**/
/*
6. Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
*/
/*
let god = +prompt('Введите год',1);
let c=god%4;
if(c===0)  {
    document.write(`<h2>Год:  ${god} высокосный</h2>`);
} else {
    document.write(`<h2>Год:  ${god} невысокосный</h2>`);
}
/***/
/*
7. Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
*/

let NameJS = prompt('Яка «офіційна» назва JavaScript?','JS');

if(NameJS==='ECMAScript')  {
    document.write(`<h2>Правильно!</h2>`);
} else {
    document.write(`<h2>Не знаєте? ECMAScript!</h2>`);
}
/*****/