/*********************************************************************************************/
/* 1. Створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)          */
/* 2. Створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)          */
/* 3. Створити функцію яка повертає найбільше число з масиву                                 */
/* 4. Створити функцію яка повертає найменьше число з масиву                                 */
/* 5. Створити функцію яка приймає масив чисел, сумує значення елементів масиву              */
/*    та повертає його. Приклад [1,2,10]->13                                                 */
/* 6. Створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень. */
/* 7. Створити функцію яка приймає будь-яку кількість чисел, повертає найменьше,             */
/*    а виводить найбільше (Math використовувати заборонено);                                */
/* 8. Створити функцію яка заповнює масив рандомними числами  (цей код генерує рандомні      */
/*    числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.      */
/* 9. Створити функцію яка заповнює масив рандомними числами в діапазоні                     */
/*    від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.        */
/* 10. Функція приймає масив та робить з нього новий масив в зворотньому                     */
/*     порядку. [1,2,3] -> [3, 2, 1].                                                        */
/*********************************************************************************************/
document.write(`<h1>ClassWork_JS #4</h1>`);
console.log('ClassWork_JS #4');

