  document.write(`<h1>ClassWork_JS #2 </h1>`);
/*
1. Користувач вводить або має два числа.
    Потрібно знайти та вивести максимальне число з тих двох .
    Також потрібно врахувати коли введені рівні числа.


2. У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
Користувач вводить номер квартири просто в змінні або через prompt('') .
    Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.


3. Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення
   ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

4. Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
    якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
якщо в змінну записали щось інше, спрацьовує else


5. Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
    Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН


6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності
 від введеного числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді
 вивести Повідомлення - що число не вірне ... .
*/


/*
1. Користувач вводить або має два числа.
    Потрібно знайти та вивести максимальне число з тих двох .
    Також потрібно врахувати коли введені рівні числа.
*/
console.log('Start');
/*
let a1 = prompt('Введите первое число:', 1);
let a2 = prompt('Введите второе число:', 1);
let max;
if(a1>a2) {
    max=a1;
} else if(a1<a2) {
    max=a2;
} else if (a1===a2) {
    max='Числа равны';
}

alert(`a1= ${a1} a2=${a2}   Максимальное число: ${max}`);

/*
2. У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
Користувач вводить номер квартири просто в змінні або через prompt('') .
    Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
*/
//alert('Подъезд_1');
/*
let flat_number = prompt('Введите номер квартиры:', 1);
console.log(flat_number);
if(1<=flat_number && flat_number<=20) {
    alert('Подъезд_1')
} else if(21<=flat_number && flat_number<=48) {
    alert('Подъезд_2')
} else if(49<=flat_number && flat_number<=90) {
    alert('Подъезд_3')
} else {
    alert('Квартиры с таким номером нет')
}

/*
3. Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення
   ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
*/
/*
let number = prompt('Введите число', 1);
if(number==10) {
    alert('ВІРНО')
} else {
    alert('НЕВІРНО')
}
/*****/


/*
4. Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
    якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
якщо в змінну записали щось інше, спрацьовує else
*/
/*
let x1;
let x22=prompt('Введите число от 6 до 9', 1);
    if (x22==6) {
        x1=20;
        console.log(x1);
    }
    else if(x22==7) {
        x1='snroka';
        console.log(x1);
    }
    else if(x22==8) {
        x1=true;
        console.log(x1);
    }
    else if(x22==9) {
         x1=x1=[1, 2, 3, 'stroka'];
         console.log(x1);
    }

let tips=typeof (x1);
console.log(tips);
 switch (tips) {
     case "number":
         console.log("Переменная числового типа");
         document.write(`<h2>1</h2>`);
         document.write(`<h2>Переменная числового типа</h2>`);
         break;
     case "string":
         console.log("Переменнтая строчного типа");
         document.write(`<h2>2</h2>`);
         document.write(`<h2>Переменная строчного типа</h2>`);
         break;
     case "boolean":
         console.log("Переменная булевого типа");
         document.write(`<h2>3</h2>`);
         document.write(`<h2>Переменная булевого типа</h2>`);
         break;
     case "object":
         console.log("Переменная булевого типа");
         document.write(`<h2>4</h2>`);
         document.write(`<h2>Переменная типа "объект"</h2>`);
         break;
     default:
         console.log("Переменнтая булевого типа");
         document.write(`<h2>????????</h2>`);
         document.write(`<h2>Тип переменной не определен</h2>`);
 }
/*****/

/*
5. Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
    Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
*/
/*
let t;
let x10;
for(t=0;t<1;t++) {
    x10=prompt('Введите значение температуры:', 1);
}
if(10<=x10 && x10<=22) {
    document.write(`<h2>Температура ${x10} ми йдемо ВЧИТИСЯ</h2>`);
} else {
    document.write(`<h2>Температура ${x10} сидимо вдома і вчимося ОНЛАЙН</h2>`);
}
/**/

/*
6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності
від введеного числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести
Повідомлення - що число не вірне ... .
 */


let chislo;
chislo=prompt('Угадайте число', 10);
console.log(chislo);
switch (chislo) {
    case "1":
        document.write(`<h2>Вы выиграли Авто</h2>`);
        console.log("Вы выиграли Авто");
        break;
    case "2":
        document.write(`<h2>Вы выиграли Мото</h2>`);
        console.log("Вы выиграли Мото");
        break;
    case "4":
        document.write(`<h2>Вы выиграли Телефон</h2>`);
        console.log("Вы выиграли Телефон");
        break;
    case "8":
        document.write(`<h2>Вы выиграли Ноутбук</h2>`);
        console.log("Вы выиграли Ноутбук");
        break;
    case "16":
        document.write(`<h2>Вы выиграли Квадрокоптер</h2>`);
        console.log("Вы выиграли Квадрокоптер");
        break;
    default:
        document.write(`<h2>На это раз вы ничего не выиграли, пробуйте еще...</h2>`);
        console.log("На это раз вы ничего не выиграли, пробуйте еще");
}
/*****/