/*********************************************************************************************/
/*  1. Створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б       */
/*  2. Створити функцію яка обчислює та повертає площу кола з радіусом r                     */
/*  3. Створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r     */
/*  4. Створити функцію яка приймає масив та виводить кожен його елемент                     */
/*  5. Створити функцію яка створює параграф з текстом. Текст задати через аргумент          */
/*  6. Створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий  */
/*  7. Cтворити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
       Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
- створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

- створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.

 */
document.write(`<h1>HomeWork_JS #4</h1>`);
console.log('HomeWork_JS #4');
/*  Створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б */
let i;
let a1=2;  /* ширина прямоугольника */
let b1=3;  /* высота прямоугольника */
document.write(`<h2>Задание №1</h2>`);
document.write(`<h2>Створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б</h2>`);
console.log('Задание №1');
console.log('Створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б');
function ploshad1(a,b)  {
 return a*b;
}
for(i=0;i<10;i++) {
    document.write(`<h2>Площадь прямоугольника со сторонами ${a1} и ${b1} равна: ${ploshad1(a1,b1)}</h2>`);
    console.log('Площадь прямоугольника со сторонами',a1,' и ',b1,'равно: ',ploshad1(a1,b1));
    a1++;
    b1++;
}

/*  2. Створити функцію яка обчислює та повертає площу кола з радіусом r  */
let r1=1;  /* Радиус круга */
document.write(`<h2>Задание №2</h2>`);
document.write(`<h2>Створити функцію яка обчислює та повертає площу кола з радіусом r</h2>`);
console.log('Задание №2');
console.log('Створити функцію яка обчислює та повертає площу кола з радіусом r');
function ploshad2(r)  {
    return  Math.PI*r**2;
}
for(i=0;i<10;i++) {
    document.write(`<h2>Площадь круга радиуса ${r1} равна: ${ploshad2(r1)}</h2>`);
    console.log('Площадь круга радиуса ',r1,'равна: ',ploshad2(r1));
    r1++;
}

/*  3. Створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r     */
let r2=1;  /* Радиус цилиндра */
let h1=1   /* Высота цилиндра */
document.write(`<h2>Задание №3</h2>`);
document.write(`<h2>Створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r</h2>`);
console.log('Задание №3');
console.log('Створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r');
function ploshad3(r,h)  {
    return 2*Math.PI*r**2+2*Math.PI*r*h;
}
for(i=0;i<10;i++) {
    document.write(`<h2>Площадь цилиндра радиусом ${r2} и высотой ${h1} равна: ${ploshad3(r2, h1)}</h2>`);
    console.log('Площадь цилиндра радиусом ',r2,' и высотой ',h1,' равна: ', ploshad3(r2, h1));
    r2++;
    h1+=2;
}
/*  4. Створити функцію яка приймає масив та виводить кожен його елемент  */
document.write(`<h2>Задание №4</h2>`);
document.write(`<h2>Створити функцію яка приймає масив та виводить кожен його елемент</h2>`);
console.log('Задание №4');
console.log('Створити функцію яка приймає масив та виводить кожен його елемент');
let massiv1=[1,'DSG',false,-243,'Stereo',56.22,true,12,'SPG','NAVY','KSP',25,97,-123];
function mass1(mas) {
    let i;
    for(i=0;i<mas.length;i++) {
        document.write(`<h2>Элемент ${i+1} массива равен ${mas[i]}</h2>`);
        console.log('Элемент ',i+1,' массива равен',mas[i]);
    }
}
mass1(massiv1);
/*  5. Створити функцію яка створює параграф з текстом. Текст задати через аргумент  */
document.write(`<h2>Задание №5</h2>`);
document.write(`<h2>Створити функцію яка створює параграф з текстом. Текст задати через аргумент</h2>`);

let massiv2=['Баг багом исправляют','Программиста руки кормят… и кофе','Ваши слова да техлиду в уши',
             'Знать не знаю, читать не читаю','Тестировщик не выдаст, заказчик не съест',
             'Сервер от клиента не далеко падает','Хорошо там, где тасков нет'];

let massiv3=['Хороший программист всегда смотрит и направо, и налево прежде чем перейти улицу с односторонним ' +
             'движением','Не волнуйся, если не работает. Если бы все всегда работало, у тебя бы не было работы',
             'Самая большая проблема с программистами в том, что ты никогда не сможешь понять, чем он занимается, ' +
             'пока не будет слишком поздно','Большинство из вас знают достоинства программистов.' +
             ' Их, конечно же, три: лень, нетерпеливость и высокомерие','Всегда пиши код так, как будто человек,' +
             ' который будет его саппортить — психопат-убийца, который знает, где ты живешь',
             ' Плохое ПО одного человека — постоянная работа другого',
             ' Если бы строители строили дома так, как программисты пишут код, то первый же дятел, ' +
             ' присевший на фасад, уничтожил бы цивилизацию',' Если сразу не получилось хорошо, назовите ' +
             'это версией 1.0',' Когда создадут язык программирования, который позволит программистам писать ' +
             'код на английском языке, выяснится, что они не знают английского',
             ' Почему у нас никогда нет времени на то, чтобы сделать все правильно,' +
             ' но всегда есть время на то, чтобы сделать этого больше?',
             ' Любой твой код, в который ты не заглядывал больше шести месяцев, будет выглядеть как код,' +
             ' который написал кто-то другой',
             ' Ходить по воде и разрабатывать ПО из спецификации легко. Просто нужно заморозить и то, и другое',
             ' Первые 90% кода занимают первые 90% времени на разработку… Оставшиеся 10% кода ' +
             'занимают еще 90% времени на разработку'];
let zagol1='Афоризмы, цитаты, пословицы';
let zagol2='Только пословицы...';
function MassCreatPar(zagolovok,mas) {
    document.write(`<h3>${zagolovok}</h3>`);
    for(i=0;i<mas.length;i++)  {
        document.write(`<p>${i+1}.  ${mas[i]}.</p>`);
    }
}
MassCreatPar(zagol1,massiv3);
MassCreatPar(zagol2,massiv2);
/*  6. Створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий */
document.write(`<h2>Задание №6</h2>`);
document.write(`<h2>Створити функцію яка створює ul з трьома елементами li. Текст li задати через 
аргумент всім однаковий</h2>`);
let zagol3='Список товаров: ';
let Tovar='Товар';
function MassCreatUl(zagolovok,mas) {
    document.write(`<h3>${zagolovok}</h3>`);
    document.write(`<ul>`);
    for(i=0;i<3;i++)  {
        document.write(`<li>${i+1}.  ${mas}.</li>`);
    }
    document.write(`</ul>`);
}
MassCreatUl(zagol3,Tovar);










/****/
