console.log('HomeWork #7');
document.write(`<h1>HomeWork #7</h1>`);

/**********************************************************************************************************************

 1. Створити функцію конструктор для об'єктів User з полями id, name, surname , email, phone
 створити пустий масив, наповнити його 10 об'єктами new User(....)

 - Взяти масив з  User[] з попереднього завдання, та відфільтрувати , залишивши тільки об'єкти з парними id (filter)

 - Взяти масив з  User[] з попереднього завдання, та відсортувати його по id. по зростанню (sort)

 - створити класс для об'єктів Client з полями id, name, surname , email, phone, order (поле є масивом зі списком товарів)
 створити пустий масив, наповнити його 10 об'єктами Client
 - Взяти масив (Client [] з попереднього завдання).Відсортувати його по кількості товарів в полі order по зростанню. (sort)


 - Створити функцію конструктор яка дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
 -- drive () - яка виводить в консоль `їдемо зі швидкістю ${максимальна швидкість} на годину`
 -- info () - яка виводить всю інформацію про автомобіль в форматі `назва поля - значення поля`
 -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
 -- changeYear (newValue) - змінює рік випуску на значення newValue
 -- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і додає його в поточний об'єкт car


 - (Те саме, тільки через клас)
 Створити клас який дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
 -- drive () - яка виводить в консоль `їдемо зі швидкістю ${максимальна швидкість} на годину`
 -- info () - яка виводить всю інформацію про автомобіль в форматі `назва поля - значення поля`
 -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
 -- changeYear (newValue) - змінює рік випуску на значення newValue
 -- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і додає його в поточний об'єкт car

 -створити класс/функцію конструктор попелюшка з полями ім'я, вік, розмір ноги. Створити масив з 10 попелюшок.
 Сторити об'єкт класу "принц" за допомоги класу який має поля ім'я, вік, туфелька яку він знайшов.
 За допомоги циклу знайти яка попелюшка повинна бути з принцом.
 Додатково, знайти необхідну попелюшку за допомоги функції масиву find та відповідного колбеку

 *********************************************************************************************************************/
/*  1. Створити функцію конструктор для об'єктів User з полями id, name, surname , email, phone  */

/*       створити пустий масив, наповнити його 10 об'єктами new User(....)                       */
function User_1(name) {
    this.name = name;
    this.isAdmin = false;
}

let user_1 = new User_1("Вася");
console.log(user_1.name);
console.log(user_1.isAdmin);
console.log('_______________________');

function User(id, name, surname, email, phone) {
    this.id = id;
    this.name = name;
    this.surname = surname;
    this.email = email;
    this.phone = phone;
}
const user1 = new User(32, 'Oleg', 'Ivaniuk', 'oleg.ivanov@gmail.com', '+380 50 641 6598');
const user2 = new User(84, 'Irina', 'Petuhova', 'irina.petuhova@gmail.com', '+380 67 621 3254');
const user3 = new User(54, 'Aleksei', 'Levchenko', 'aleksei.levchenko@gmail.com', '+380 93 563 2489');
const user = [user1, user2, user3];
console.log(user);




