document.write(`<h1>Homework_JS_#1</h1>`);

/*
1. Створити змінні. Присвоїти кожному з них значення: 'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16,
  true, false.
  Вивести кожну змінну за допомогою: console.log , alert, document.write
2. Переприсвоїти кожній змінній з завдання значення на довільне.
  Вивести кожну змінну за допомогою: console.log , alert, document.write
3. Створити 3 змінних firstName, middleName, lastName, наповнити їх своїм ПІБ. З'єднати їх в одну змінну person.
   (Не об'єкт)
4. За допомогою 3х різних prompt() отримати 3 слова які являються вашими Імям, По-Батькові та роками.
    Вивести "Вітаю *Імя* *По батькові*. Тобі *вік* років".
5. За допомогою оператора typeof визначити типи наступних змінних та вивести їх в консоль.
  let a = 100; let b = '100'; let c = true;
6. Визначити відповідний оператор в виразах що б вийшов відповідний результат.
В однакових виразах не використовувати однакові оператори!!!
  5 ? 6 -> true
  5 ? 6 -> false
  5 ? 6 -> false
  5 ? 6 -> false
  10 ? 10 -> true
  10 ? 10 -> true
  10 ? 10 -> false
  10 ? 10 -> false
  10 ? 10 -> false
  123 ? '123' -> false
  123 ? '123' -> true

7. Подумайте Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
    let str = "20";
     let a = 5;
     document.write(str + a + "<br/>");
     document.write(str - a + "<br/>");
     document.write(str * "2" + "<br/>");
     document.write(str / 2 + "<br/>");


 */

/*
1. Створити змінні. Присвоїти кожному з них значення: 'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16,
    true, false.
    Вивести кожну змінну за допомогою: console.log , alert, document.write
*/

let massiv = ['hello', 'owu', 'com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16, true, false];


/*
let i;
for(i=0;i<massiv.length;i++) {
    console.log(massiv[i]);
   // alert(massiv[i]);
    document.write(`<h2>Елемент ${i+1} масиву дорівнює ${massiv[i]}</h2>`);
}

/* 2. Переприсвоїти кожній змінній з завдання значення на довільне.
    Вивести кожну змінну за допомогою: console.log , alert, document.write
*/
/*
for(i=0;i<massiv.length;i++) {
    massiv[i]=Math.round(Math.random()*100);
    console.log(massiv[i]);
  //  alert(massiv[i]);
    document.write(`<h2>Елемент ${i+1} масиву дорівнює ${massiv[i]}</h2>`);
}

/*
3. Створити 3 змінних firstName, middleName, lastName, наповнити їх своїм ПІБ. З'єднати їх в одну змінну person.
(Не об'єкт)
*/
/*
let firstName, middleName, lastName, person;
let probel;
 firstName = 'Pugachenko';
 middleName =  'Nikolay';
 lastName = 'Anatolievich';
 probel= ' ';
 person = firstName + probel + middleName + probel + lastName;
 document.write(`<h2>${person}</h2>`);

/*4. За допомогою 3х різних prompt() отримати 3 слова які являються вашими Імям, По-Батькові та роками.
    Вивести "Вітаю *Імя* *По батькові*. Тобі *вік* років".
*/
/*
let name = prompt('Введите свое имя:', 'имя');
let otchestvo = prompt('Введите свое отчество?:', 'отчество');
let surname = prompt('Введите свою фамилию:', 'фамилия');
let age = prompt('Сколько Вам лет?', 100);
alert(`Вітаю ${name} ${otchestvo} ${surname}. Тобі ${age} років `);
/****/
/*   За допомогою оператора typeof визначити типи наступних змінних та вивести їх в консоль.
     let a = 100; let b = '100'; let c = true;
*/
let a = 100;
let b = '100';
let c = true;
console.log(typeof(a));
console.log(typeof(b));
console.log(typeof(c));

/*
6. Визначити відповідний оператор в виразах що б вийшов відповідний результат.
В однакових виразах не використовувати однакові оператори!!!
  5 ? 6 -> true
  5 ? 6 -> false
  5 ? 6 -> false
  5 ? 6 -> false
  10 ? 10 -> true
  10 ? 10 -> true
  10 ? 10 -> false
  10 ? 10 -> false
  10 ? 10 -> false
  123 ? '123' -> false
  123 ? '123' -> true
*/
let a1;

a1=5<6;  //  true
console.log(a1);
a1=5>6;  //  false
console.log(a1);
a1=5===6;  //  false
console.log(a1);
a1=5>=6;  //  false
console.log(a1);

a1=10===10;  //  true
console.log(a1);
a1=10>=10;   //  true
console.log(a1);
a1=10!==10;   //  false
console.log(a1);
a1=10>10;   //  false
console.log(a1);
a1=10<10;   //  false
console.log(a1);

/*
7. Подумайте Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
    let str = "20";
let a = 5;
document.write(str + a + "<br/>");
document.write(str - a + "<br/>");
document.write(str * "2" + "<br/>");
document.write(str / 2 + "<br/>");
*/

let str = "20";
let a6 = 5;
let str1 = 2;

document.write(str + a6 + "<br/>"); /* Первая переменная является строковой, вторая - числовой.  Оператор "+" между
первой и второй переменный преобразует вторую переменную в строковую, в результате сложения получаем строковую
переменную.
"<br/>" является строкой. В результате соединия с первыми двумя переменными оператором "+" получаем такую строку
"205<br/>". В браузере отображается только "205", т.к. "<br/>" браузер определяет как закрывающую часть тега,
поэтому не отображает. В окне браузера видим 205 */
//console.log(str + a6 + "<br/>");

document.write(str - a6 + "<br/>");  /* Первая переменная является строковой, вторая - числовой.  Оператор "-" между
первой и второй переменный преобразует первую переменную в числовую, в результате получаем сложение двуч числовых
переменных, число 15. Т.к. "<br/>" является строкой. В результате соединия с первыми двумя переменными оператором "+"
результат сложения двух первых переменных и третьей переменной получаем преобразования в строку, котораяи имеет
следующий вид:  "15<br/>". В браузере отображается только "15", т.к. "<br/>" браузер определяет как закрывающую
часть тега,поэтому не отображает. В окне браузера видим 15 */
//console.log(str - a6 + "<br/>");

document.write(str * "2" + "<br/>");  /* Первая и вторая переменные являются строковыми. Оператор "*", который
стоит между ними преобразует эти переменные в числовые и выполняет умножение.  Результат умножения первых двух
переменных прибавляется оператором "+" к третьей переменной, преобразуя результат умножения в строчную переменную.
В результате сложения со строкой "<br/>", получаем 40<br/>.  В браузере отображается только "40", т.к. "<br/>"
браузер определяет как закрывающую часть тега,поэтому не отображает. В окне браузера видим 40 */
//console.log(str * "2" + "<br/>");

document.write(str / 2 + "<br/>");  /* Первая переменная является строковой, вторая - числовой.  Оператор "/" между
первой и второй переменный преобразует первую переменную в числовую, в результате деления получаем число 15.
Далее выполняется операция сложения, при которой результат деления преобразуется с строку.
В результате сложения со строкой "<br/>", получаем 10<br/>.  В браузере отображается только "10", т.к. "<br/>"
браузер определяет как закрывающую часть тега,поэтому не отображает. В окне браузера видим 10 */
//console.log(str / "2" + "<br/>");

console.log(typeof(str1));