/****************************************************************************************************
Задание:
 1. створити масив з:
    1.1. з 5 числових значень
    1.2. з 5 стічкових значень
    1.3. з 5 значень стрічкового, числового та булевого типу
    1.4 та вивести його в консоль

2. Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
   Вивести в консоль

    2.1 За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
    2.2 За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
    2.3 За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
    2.4 За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
3.
    3.1 Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
    3.2 Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
    3.3 Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
    3.4 Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести
         тільки булеві елементи
    3.5 Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести
         тільки числові елементи
    3.7 Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести
         тільки рядкові елементи

- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до
 конкретних індексів. Вивести в консоль всі його елементи в циклі.
- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log
 та document.write
- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log
 та document.write
- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log
 та document.write
- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
 /*********************************************************************************************************/
/*
1. створити масив з:
    1.1. з 5 числових значень
    1.2. з 5 стічкових значень
    1.3. з 5 значень стрічкового, числового та булевого типу
    1.4 та вивести його в консоль
*/
let i;
/*
let chisla=[33, -258, 156, -57, 48];
let stroki=['JavaScript', 'USA', 'c++', 'MAn', 'ADIDAS'];
let mass1=['GAP', 'true', 213, false, 'Iffan'];

console.log('___Массив_из_5_числовых_элементов__________________________');
for(let a of chisla) {
    console.log(a);
    a++;
}
console.log('___Массив_из_5_строчных_элементов__________________________');
for(let a of stroki) {
    console.log(a);
    a++;
}
console.log('___Массив_из_5_элементов_(числовые_строчные_булевы)_________');
for(let a of mass1) {
    console.log(a);
    a++;
}
/**/
/*
2. Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
    Вивести в консоль
*/

let mass2=[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
let mass3=['method', 'takescallback', 'that', 'performs', 'operation', 'elements', 'returns', 'containing',
    'resulting', 'running', 'operation', 'does', 'mutate', 'calling'];
let mass4=[25, -56, 92, 253, -17, 35, 191, -15, 68, 19, -73];
let mass5=[true, false, false, true, true, true, false, false, true, false, true, false];

let j,k,t,n;
j=0;
k=0;
t=0;
n=0;
for (i=0;i<mass2.length;i++) {
    if(j===0) {
        mass2[i]=mass3[k];
        k++;
    } else if(j===1) {
        mass2[i]=mass4[t];
        t++;
    } else if (j===2) {
        mass2[i]=mass5[n];
        n++;
    }
    if (j<2) {
        j++;
    } else {
        j=1;
    }
  //  mass2[i]=mass3[i];
    console.log('mass2[',i,']=',mass2[i]);
}
/***/
/* 2.1 За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині */
let mass7=['Mercedes-Benz', 'Toyota', 'BMW', 'Porsche', 'Audi', 'Volkswagen', 'Ford', 'Chevrolet', 'Mazda',
           'Nissan'];

document.write(`<h2>Известные марки авто:</h2>`);
for (i=0;i<mass7.length;i++) {
    document.write(`<div>${mass7[i]}</div>`);
}
/* 2.2 За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині */
document.write(`<h2>___Известные марки авто:___</h2>`);
for (i=0;i<mass7.length;i++) {
    document.write(`<div>${i+1}.--------${mass7[i]}</div>`);
}
/* 2.3 За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині */
let mass8=['Mercedes-Benz', 'Toyota', 'BMW', 'Porsche', 'Audi', 'Volkswagen', 'Ford', 'Chevrolet', 'Mazda',
    'Nissan', 'Opel', 'Subaru', 'Suzuki', 'Lexus', 'Mitsubishi', 'Jeep','Cadillac', 'Lincoln', 'Ferrari',
    'Lamborghini'];////, 'Maserati', 'Fiat'];
document.write(`<h1>__________Известные марки авто:____________</h1>`);
i=0;
while (i<mass8.length) {
    document.write(`<h1>${mass8[i]}</h1>`);
    i++;
}
/* 2.4 За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині */
document.write(`<h1>__________Известные марки авто:____________</h1>`);
i=0;
while (i<mass8.length) {
    document.write(`<h1>${i+1}.   ${mass8[i]}</h1>`);
    i++;
}
/***/
/* 3.1 Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі. */

let mass9=[];
console.log('___Вывод массива числовых элементов___');
for (i=0; i<10; i++) {
    mass9[i]=Math.floor(Math.random()*100);
    console.log(mass9[i]);
}
/* 3.2 Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі. */
console.log('__________Известные марки авто: (массив строчных элементов)____________');
i=0;
while (i<mass8.length) {
    console.log('__',mass8[i]);
    i++;
}
/*будь-якого типу. Вивести в консоль всі його елементи в циклі. */
console.log('_________Массив 10 элементов различного типа_________')
let mass10=[];
for (i=0;i<10;i++) {
    mass10[i]=mass2[i];
    console.log('Массив10[',i+1,']=',mass10[i]);
}
/* 3.4 Створити масив з 10 елементів числового, стірчкового і булевого типу. */
/*      За допомогою if та typeof вивести тільки булеві елементи             */
console.log('__только булевы значения__');
for (i=0;i<mass10.length;i++) {
    if(typeof (mass10[i])==="boolean") {
        console.log('Массив10[',i+1,']=',mass10[i]);
    }
}
/*  3.5 Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести
         тільки числові елементи    */
console.log('__только числовые значения__');
for (i=0;i<mass10.length;i++) {
    if(typeof (mass10[i])==="number") {
        console.log('Массив10[',i+1,']=',mass10[i]);
    }
}
/* 3.7 Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести
        тільки рядкові елементи   */
console.log('__только строчные значения__');
for (i=0;i<mass10.length;i++) {
    if(typeof (mass10[i])==="string") {
        console.log('Массив10[',i+1,']=',mass10[i]);
    }
}






























