/****************************************************************************************************
Задание:
 1. створити масив з:
    1.1. з 5 числових значень
    1.2. з 5 стічкових значень
    1.3. з 5 значень стрічкового, числового та булевого типу
    1.4 та вивести його в консоль

-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
 Вивести в консоль

- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести
 тільки булеві елементи
- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести
 тільки числові елементи
- Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести
 тільки рядкові елементи

- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до
 конкретних індексів. Вивести в консоль всі його елементи в циклі.
- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log
 та document.write
- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log
 та document.write
- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log
 та document.write
- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
 /**********************************************************************************************************/
/*
1. створити масив з:
    1.1. з 5 числових значень
    1.2. з 5 стічкових значень
    1.3. з 5 значень стрічкового, числового та булевого типу
    1.4 та вивести його в консоль
*/

let chisla=[33, -258, 156, -57, 48];
let stroki=['JavaScript', 'USA', 'c++', 'MAn', 'ADIDAS'];
let mass1=['GAP', 'true', 213, false, 'Iffan'];
let i;

console.log('___Массив_из_5_числовых_элементов__________________________');
for(let a of chisla) {
    console.log(a);
    a++;
}
console.log('___Массив_из_5_строчных_элементов__________________________');
for(let a of stroki) {
    console.log(a);
    a++;
}
console.log('___Массив_из_5_элементов_(числовые_строчные_булевы)_________');
for(let a of mass1) {
    console.log(a);
    a++;
}
/**/





































