/*************************************************************************************/
/*  1. Cтворити функцію, яка якщо приймає один аргумент, просто вивдоить його,       */
/*     якщо два аргументи - складає або конкатенує їх між собою.                     */
/*  2. Створити функцію  яка приймає два масиви та скаладає значення елементів       */
/*     з однаковими індексами  та повертає новий результуючий масив.                 */
/*      EXAMPLE:     */
/*      [1,2,3,4]    */
/*      [2,3,4,5]    */
/*      результат    */
/*      [3,5,7,9]    */
/*  3. Створити функцію яка приймає масив будь яких объектів,  */
/*      та повертає масив ключів всіх обєктів                  */
/*      EXAMPLE:     */
/*      [{name: 'Dima', age: 13}, {model: 'Camry'}]  ===> [ name, age, model ]      */
/*  4. Створити функцію яка приймає масив будь яких объектів,                       */
/*          та повертає масив значень всіх обєктів                                  */
/*      EXAMPLE:                                                                    */
/*      [{name: 'Dima', age: 13}, {model: 'Camry'}]  ===> [ Dima, 13, Camry ]       */
/************************************************************************************/
document.write(`<h1>AdditionalWork_#4</h1>`);
console.log('AdditionalWork_#4');
/*  1. Cтворити функцію, яка якщо приймає один аргумент, просто вивдоить його,       */
/*     якщо два аргументи - складає або конкатенує їх між собою.                     */

function funcSch() {
    let i;
    console.log('_________',arguments.length);
    for(i=0;i<arguments.length;i++) {
        console.log(arguments[i]);
    }
}
funcSch(14416,-2001241,35121,46454,654,16631,1);
funcSch(2);












